{
  "leaderboard": "Leaderboard",
  "leaderboardTitle": "🌍 Global Leaderboard",
  "yourRank": "Your Rank",
  "loading": "Loading...",
  "error": "Failed to load leaderboard. Please check Firebase configuration.",
  "empty": "Leaderboard is currently empty",
  "privacyNoticeRequired": "Please accept the privacy notice to view the leaderboard...",
  "globalCount": "Global Participants: {count} Alchemists",
  "editNickname": "Edit Nickname",
  "save": "Save",
  "privacy": {
    "title": "Alchemist Confidentiality Agreement",
    "subtitle": "ALCHEMIST CONFIDENTIALITY AGREEMENT",
    "sectionTitle": "Privacy Commitment",
    "content": "We use Firebase anonymous authentication technology. Data is encrypted, and the system only records \"nickname\" and \"total earnings\". We never collect real names or geographic locations.",
    "funnyText": "Don't worry, even if you reach \"Chief Toilet Officer\", your boss will only think you're working hard. On this leaderboard, you're just a legendary code.",
    "button": "I Agree",
    "shieldTooltip": "Anonymous Protection Active: Data encrypted and synced to cloud laboratory."
  },
  "levelup": {
    "1": "The starting point. Right now, you are just a disposable asset.",
    "2": "First step to freedom. You've mastered the art of hiding behind the porcelain throne.",
    "3": "Your skills are verified. Management still hasn't noticed your \"disappearing\" act.",
    "4": "Officially initiated. The money you earned here can now cover your utility bills.",
    "5": "Your job title is now a verb. The company literally pays for your bio-break.",
    "6": "You know the bathroom better than your own desk. This is your true home.",
    "7": "Professional slacking doesn't need water, just a soundproof stall.",
    "8": "You've achieved \"irreplaceability\" because no one knows what you do in there.",
    "9": "You are now the company's appendix. Useless, but cutting you out would hurt.",
    "10": "It's not theft anymore; it's a daylight robbery of the company's profit margin.",
    "11": "A miracle occurred. Your bathroom wealth is now impacting the quarterly report.",
    "12": "Legend born! You've transmuted enough to own the stall. You are the King of Toilets."
  },
  "exchange": {
    "health_critical": [
      "Emergency Room Co-pay | You earned just enough to pay for the ER. Get up, your anus is screaming.",
      "Hemorrhoid Surgery Fund | Keep squatting, the doctor misses you.",
      "Leg Amputation Risk | Can't feel your legs? That's because they're dead."
    ],
    "health_warning": [
      "Donut Cushion | You'll need this to sit at your desk tomorrow.",
      "Toilet Seat Imprint (Permanent) | Your butt has fused with the toilet seat.",
      "Boss's Suspicion | Gone so long, your boss thinks you're mining crypto in the bathroom."
    ],
    "wealth_micro": [
      "Boss's CO2 | You stole a breath of air from the company. This is the beginning of revenge.",
      "Static Electricity | You took nothing but friction.",
      "Void | Form is emptiness, emptiness is salary.",
      "The Manager's Fake Smile | It's cold, but at least they're too busy to yell at you.",
      "Unread Slack Messages | Escaping is shameful but useful; you've earned five more seconds of peace.",
      "Fingerprints on the Screen | Physical evidence of your hard work, even if it looks like slacking.",
      "A Dead Mouse | It's a sign from above to stare blankly at your desk legitimately.",
      "Water Cooler Bubbles | That 'glug' sound means the company just paid for your elimination process.",
      "Toilet Stall Graffiti | The only social media in the company where you can speak your mind.",
      "Residual Toilet Seat Heat | You took the warmth from the last colleague; that's how traditions are passed.",
      "Untitled Excel Save | Filled with career anxiety and endless emptiness.",
      "Broken Water Dispenser Button | Like your promotion chances, nothing happens when you press it.",
      "The Scent of Photocopies | The smell of capitalism; it smells like your youth burning.",
      "Slack 'Typing...' | They type, they stop, your heart hangs in the balance.",
      "Printer Standby Hum | It's waiting for commands; you're waiting for freedom.",
      "Spinning PDF Icon | Round and round, spinning away your youth.",
      "Worn Mousepad Edge | The trenches of your countless ineffective clicks.",
      "Excel Scroll Bar | Even at the bottom, you won't find the meaning of life.",
      "A Blank Notebook | Like your head, filled with the desire to clock out.",
      "Expired Meeting Invite | Meetings that didn't happen were stolen moments of freedom.",
      "HR's Canned Response | Proof you're still in the system.",
      "Screensaver Motion | Staring at the only universe you can truly control.",
      "Footsteps in the Hall | The sound of capitalism, but it can't cross this door.",
      "Auto-save Icon | Thanks to this split-second lag, giving you an excuse to stop thinking.",
      "Transparent Paperclip Box | Filled with your ineffective constraints on the system.",
      "Expired E-signature | Signed your life away, but the ink is dry.",
      "Broken Water Dispenser Switch | Like your motivation, no passion flows.",
      "#REF! Error in Excel | Your career reference point has been lost.",
      "Blue Screen of Death | The best paid leave God ever gave you.",
      "Greasy Fingerprints on Screen | Blurred reality, but cleared your vision of slacking.",
      "Ignored Group Stickers | A wage slave's last shred of dignity, vanishing in silence.",
      "Expired Keycard | It can't take you anywhere except this prison called work.",
      "Hidden Excel Sheet | Hiding your secrets, which is just today's lunch menu.",
      "Printer Paper Jam Warning | A tiny protest against this boring world.",
      "Missed Anonymous Call | Could be a headhunter, could be a scam, but it was your hope.",
      "Expired Annual Report | After reading it, you still can't afford any of the dreams inside.",
      "Mouse Drag Resistance | A reminder that life's path is full of obstacles.",
      "Vending Machine 'Out of Stock' | Even the machine is telling you today's luck is bad.",
      "Broken 'Esc' Key | Means you can't escape; you must continue alchemy.",
      "Post-it Residue on Screen Edge | Stuck to your past, but can't stick to your future.",
      "PC Heat Output | At least it warms your cold heart in the office.",
      "Expired Zoom Link | Meetings you didn't attend are your fondest memories.",
      "Unclaimed Package List | Might contain freedom, but you're too afraid to claim it.",
      "Expired Firewall Alert | Your mental defenses collapsed; only the toilet remains.",
      "Blue Loading Circle | Spinning away your anxiety, spinning into the void.",
      "Unused Public Folder | Filled with digital dust and your forgotten enthusiasm.",
      "PC Startup Beep | Declaring your labor has been reactivated.",
      "A Gap in the Stall Door | Extreme alchemy in tension and excitement.",
      "Expired Password Reset Hint | You've forgotten who you are, only remembering this salary.",
      "Auto-brightness Adjustment | It knows you're tired, but makes you keep looking.",
      "Unclaimed Meeting Minutes | Recorded all the nonsense, but not your hard work.",
      "Keyboard Crumbs | The unsightly legacy of your lunch.",
      "Low Toner Warning | Much like your nearly extinguished fighting spirit.",
      "Unread Shared Cloud | Filled with your talent that no one cares about.",
      "Mouse Double-click Failure | Dropping efficiency by 1%; a tiny revenge.",
      "Dead Pixel on Screen | Like the bloodshot in your eyes, small and stubborn.",
      "Expired Antivirus | Can't protect your soul from being eroded by work.",
      "PC Fan Noise | The only sound in this office actually trying.",
      "Unopened E-card | Hypocritical blessings are worse than this poop.",
      "Reflection on Screen | Seeing your own face longing for freedom.",
      "Old ID Card Photo | The you in the photo had light; now there's only dark circles.",
      "PC Blue Light | Simulating the aurora, fooling your brain into thinking it's on vacation.",
      "Dry Faucet | A reminder that this firm won't even give you water anymore."
    ],
    "wealth_tiny": [
      "Toilet Paper (2 sheets) | Company thanks you for helping deplete inventory.",
      "Copy Paper (1 sheet) | Fold it into a paper airplane, you earned it.",
      "Paperclip | Good for poking the reset button, otherwise useless.",
      "Pen Ink (0.5cc) | Every grain counts. Squat a thousand more times to buy a whole pen.",
      "Non-sticky Post-it | Much like your loyalty to the firm, a light breeze will blow it away.",
      "Rusty Staple | It might prick you, but it represents your tiny rebellion against the system.",
      "Dried-up Pen Ink | It's a blessing; now you have a reason not to write that report.",
      "Broken Rubber Band | Used to be tense, now as limp as your soul after work.",
      "Soggy Coaster Left by a Colleague | It's wet, but it's the only territorial expansion you have.",
      "Half a Pencil | Short, but enough to write your resignation letter (if you dared).",
      "Uncapped Marker | Its drying out foreshadows the limit of your passion for this job.",
      "Hole Punch Confetti | These are your dreams shredded by the company; colorful but useless.",
      "Plastic Stirring Stick | Perfect for stirring your murky career plans.",
      "Bent Paperclip | It's been bent by life, just like you.",
      "A Fraying Rubber Band | Stretched to its limit, much like your patience with this job.",
      "Non-sticky Post-it | What's falling isn't paper; it's your insignificant loyalty.",
      "Rusty Staple | It might prick you, but it represents your tiny rebellion against the system.",
      "Half a Pencil | Short, but enough to write your resignation letter (if you dared).",
      "Hole Punch Confetti | These are your dreams shredded by the company; colorful but useless.",
      "Uncapped Marker | Its drying out foreshadows the limit of your passion for this job.",
      "Soggy Coaster Left by a Colleague | It's wet, but it's the only territorial expansion you have besides your desk.",
      "Plastic Stirring Stick | Perfect for stirring your murky career plans.",
      "Bent Paperclip | It's been bent by life, just like you.",
      "Printer Paper Wrapper | It's trash, but it once wrapped the company's core secrets.",
      "Dried-up Pen Ink | It's a blessing; now you have a reason not to write that report.",
      "Blue Pen (Still works) | It can help you sign papers, but it can't help you sign a check.",
      "Old Charging Cable (Loose connection) | Like your energy, it only works at a specific angle.",
      "A Small Piece of String | Enough to hang your hopes on, though it could break anytime.",
      "Misprinted Annual Goals | Doesn't matter; you won't achieve them next year anyway.",
      "Rusty Binder Clip | Gripping your attendance sheet, but failing to stop time.",
      "Expired Office Snacks | They taste terrible, but it's the only calories you didn't pay for.",
      "A Broken Ruler | Making it impossible to measure the distance between you and success.",
      "Dried-up Highlighter | Can't mark the points because your life has no point.",
      "Yellow Chick Sticker from a Street Promo | Stick it on your PC to pretend you still have a childhood.",
      "Warm Tea Egg | It once had wings to fly; now it's soy-braised and yours to eat.",
      "Freshly Replaced Water Cooler Tank | You drank the freshest (company-paid) water of the day.",
      "Gum Shared by a Colleague | Chew it and pretend this is the sweetness of life.",
      "Ragged Bag with Company Logo | Advertising for the firm in exchange for tiny psychological comfort.",
      "Expired Staff Trip Brochure | Look at the places you can't go; reminisce about the leave you didn't take.",
      "Snack Crumbs Stolen from a Colleague | Small, but stolen things always taste better.",
      "Lighter with no Fluid | Can't light a cigarette, just like you can't light your passion for the future.",
      "Mask Strap with no Elasticity | Tight on your ears, tight on your right to breathe free.",
      "A Blank CD-ROM | Filled with the digital age's forgotten tears.",
      "Keyboard Mat with a Broken Leg | Making your typing wobbly, just like your position.",
      "Broken PC Cooling Fan | It's screaming, expressing your rage towards overtime.",
      "Wet Ink Pad Smudge | It stamped your promise, but it'll blur soon.",
      "Invisible Tape End | Never finding the start, much like your never-ending tasks.",
      "Expired Product Catalog | Full of outdated tech and your outdated dreams.",
      "Dried Correction Fluid | Can't erase your mistakes, only leaving white scars.",
      "Withered Succulent from a Colleague | Drying up in the AC; it's a warning to you.",
      "Non-sticky Double-sided Tape | Barely holding your dignity together, liable to snap.",
      "Little Paper Circles from the Hole Punch | They fly free; you have to stay put.",
      "Red Pen (Still works) | A screen full of edits; the painful price of your alchemy.",
      "Broken Tape Measure | The things that won't retract are the tape and your overtime.",
      "Expired Christmas Decorations | In a January office, mocking the holidays you missed.",
      "Unclaimed Disposable Chopsticks | Your final utensil for fighting capitalism.",
      "Dust Bunny under the Monitor | Six months of workplace resentment, small and solid.",
      "Expired Flu Medicine Packet | Taken so you could work, but won't cure your boredom with it.",
      "Comb with Broken Teeth | Won't smooth your hair, won't smooth your anxious heart.",
      "Dried Whiteboard Marker | Wrote your ideas, then promptly vanished into thin air.",
      "Transparent Trash Bag | Holding your labor, easily discarded by the company.",
      "Broken '=' Key on a Calculator | Never getting a result; that's your current situation.",
      "Spiritual Protection Snacks (Expired) | Praying the system won't crash, and you won't either.",
      "Uncapped Glue | Stuck to your hand, but can't stick to your desire to escape."
    ],
    "wealth_low": [
      "Convenience Store Tea Egg | Protein is the foundation of revolution. Watch your cholesterol.",
      "Yakult | Drink it, promote digestion, start the next alchemy cycle.",
      "Instant Noodles | Crush it like you're crushing your boss's dreams.",
      "Plastic Bag ($0.07) | What are you putting in it? Your salary.",
      "Cold Milk Tea | A catalyst for your bowels and your passport to escape the desk.",
      "Crumbled Instant Noodle Scraps | The salty taste of the reluctant tears you've shed.",
      "Non-winning Scratch-off | It didn't win, but it gave you five minutes of 'getting rich' dreams at work.",
      "Free Promo Tissues | Perfect for wiping away tears; don't let HR see your vulnerability.",
      "Five-dollar Supermarket Coupon | To save five dollars, you'll walk three miles. That's life.",
      "Half-eaten Convenience Store Bread | Stale, but it's energy bought with your soul.",
      "Extra Tapioca Pearls for $5 | The only 'value-add' you've achieved in the company today.",
      "A Warm Tea Egg | It once had wings to fly, now it's just soy-braised and yours to eat.",
      "Freshly Replaced Water Cooler Tank | You drank the freshest (company-paid) water of the day.",
      "Gum Shared by a Colleague | Chew it and pretend this is the sweetness of life.",
      "Instant Noodle Scraps | The salty taste of the reluctant tears you've shed.",
      "Non-winning Scratch-off | It didn't win, but it gave you five minutes of 'getting rich' dreams at work.",
      "Free Promo Tissues | Perfect for wiping away tears; don't let HR see your vulnerability.",
      "Five-dollar Supermarket Coupon | To save five dollars, you'll walk three miles. That's life.",
      "Half-eaten Convenience Store Bread | Stale, but it's energy bought with your soul.",
      "Extra Tapioca Pearls for $5 | The only 'value-add' you've achieved in the company today.",
      "A Warm Tea Egg | It once had wings to fly, now it's just soy-braised and yours to eat.",
      "Freshly Replaced Water Cooler Tank | You drank the freshest (company-paid) water of the day.",
      "Gum Shared by a Colleague | Chew it and pretend this is the sweetness of life.",
      "Cold Milk Tea | A catalyst for your bowels and your passport to escape the desk.",
      "Discounted Onigiri | The rice is a bit hard, but it's your last fortress against inflation.",
      "Rain-soaked Newspaper | Unreadable, but place it under your feet to soak up workplace humidity.",
      "Reward Stickers (x2) | Only 98 more to get that plate. Keep going, Alchemist.",
      "The Aroma of the Microwave | It's not your lunch, but smelling it is free.",
      "Expired Bento Flyer | Look at the pictures and pretend you just had a feast.",
      "Wedding Cookie Crumbs | Sharing someone else's joy to mask your own emptiness.",
      "Buy-1-Get-1 Canned Coffee | Double the caffeine, double the overtime energy.",
      "Unwanted Year-end Party Gift | It's an ugly pillow, but it's your bed at the office now.",
      "Plastic Grocery Bag | Walking down the street, carrying your poverty with pride.",
      "Promo Fan from a Cram School | Fanning away office heat, but not the boss's nonsense.",
      "Tea Egg Shell Fragments | No meat, but the scent of soy sauce is the dignity you deserve.",
      "Flat Soda | Sweet, but the passion is long gone.",
      "Disposable Raincoat | It leaks, but at least it blocks the manager's spit.",
      "Non-winning Receipt | You possessed the dream of being a millionaire for five seconds.",
      "A Small Roll of Bubble Wrap | Pop it and listen to the sound of capitalism crumbling.",
      "Expired Shopping Points | To earn this much, you might need to poop 500 more times.",
      "Tap Water with Ice | Pretending it's a cocktail on a seaside vacation.",
      "A Bite of a Colleague's Snack | Just one bite, but stolen things always taste better.",
      "Lighter with no Fluid | Can't light a cigarette, just like you can't light your passion for the future.",
      "Broken Tape Measure | The things that won't retract are the tape and your overtime.",
      "Expired Christmas Decorations | In a January office, mocking the holidays you missed.",
      "Unclaimed Disposable Chopsticks | Your final utensil for fighting capitalism.",
      "Dust Bunny under the Monitor | Six months of workplace resentment, small and solid.",
      "Expired Flu Medicine Packet | Taken so you could work, but won't cure your boredom with it.",
      "Comb with Broken Teeth | Won't smooth your hair, won't smooth your anxious heart.",
      "Dried Whiteboard Marker | Wrote your ideas, then promptly vanished into thin air.",
      "Transparent Trash Bag | Holding your labor, easily discarded by the company.",
      "Broken '=' Key on a Calculator | Never getting a result; that's your current situation.",
      "Spiritual Protection Snacks (Expired) | Praying the system won't crash, and you won't either.",
      "Uncapped Glue | Stuck to your hand, but can't stick to your desire to escape.",
      "Discounted Instant Noodles | The broth is salty, but that's the taste of your dignity.",
      "Sample Lotion from a Promo | Apply it to pretend the dry office air doesn't affect you.",
      "Second-hand Magazine | Flipping through last year's trends, living a delayed life.",
      "Dried Correction Fluid | Can't erase your mistakes, only leaving white scars.",
      "Deformed Paper Cup | Carrying your reliance on the company, wobbling.",
      "Broken Nail Clippers | Messy and hard to trim, just like your project progress.",
      "Empty Lighter Flint | No fire, but it's the only weight in your pocket.",
      "Expired Movie Coupon | Look at the date; remember the movie you missed due to overtime.",
      "Withered Succulent from a Colleague | Drying up in the AC; it's a warning to you.",
      "Eco-friendly Bag with a Weird Logo | At least it's green, even with the strange branding."
    ],
    "wealth_mid_low": [
      "Iced Milk Tea (with pearls) | The price of the breakfast shop auntie calling you handsome.",
      "Fried Chicken (uncut) | It's expensive now, but you traded poop for it.",
      "Netflix Basic Plan | Watch shows at work, double alchemy, double happiness.",
      "Bubble Tea (less sugar, less ice) | This is the blood pack for corporate slaves."
    ],
    "wealth_mid": [
      "Chicken Leg Bento (with egg) | You earned today's lunch money in the bathroom.",
      "Taxi Base Fare | Escape this company now, just go.",
      "Movie Ticket (matinee) | Pretend to meet a client, actually meeting Tom Cruise.",
      "Cheap Bluetooth Earbuds | Can't hear the boss's nonsense = good earbuds."
    ],
    "wealth_high": [
      "High-Speed Rail Ticket (non-reserved) | Enough to escape to another city and start over.",
      "Massage Voucher (30 min) | Your shoulders are stiff, but your life is stiffer.",
      "Gacha Pull (one 10-pull) | Thanks boss for sponsoring your gacha money.",
      "Premium Steak (business lunch) | Eating better than the boss, that's winning."
    ],
    "wealth_ultra": [
      "Boss's Blood Pressure Meds | You made the company stock drop 0.00001%.",
      "Ergonomic Chair (with headrest) | If you're going to prison, at least sit comfortably.",
      "Therapy Session (1 hour) | You need more than money, you need a doctor."
    ],
    "wealth_legendary": [
      "Philosopher's Stone (Kidney Stone) | Are you sure you're okay in there? Should I call an ambulance?",
      "Company Ownership (0.01%) | Congrats, you're a shareholder now.",
      "Breath of Freedom | What you earned isn't money, it's dignity."
    ],
    "wealth_overlord": [
      "Company Ownership Certificate | This poop's value exceeds the firm's net worth. Acquisition successful.",
      "The Chairman's Solid Gold Throne | Diamond-encrusted; even the flush sounds like a symphony.",
      "Hostile Takeover Proposal | You're now the majority shareholder; the Boss is making your coffee.",
      "Global Toilet Patent | From now on, everyone on Earth owes you a 0.01% royalty per flush.",
      "HR Dissolution Order | You can buy the whole department and send them to deliver takeout.",
      "The Boss's Personal Chauffeur | They're waiting outside the stall to drive you to a feast.",
      "Rooftop Helipad Rights | You don't have a chopper, but it's a great place to dry your checks.",
      "Gold-leaf Toilet Paper | Every sheet is 24K gold; watch out for chafing on your royal backside.",
      "Building Naming Rights | Tomorrow, the HQ will be officially renamed '(Your Name) Alchemy Tower'.",
      "Chairman of the Global Slacker Guild | Your name will be etched on the Wall of Honor in the Toilet Museum.",
      "The Boss's Retirement Fund | What you earned in a minute is enough to send the Boss home for good.",
      "Private Elevator (Stall Direct) | A custom lift installed just for your alchemy efficiency.",
      "Permanent Leave Warrant | No need to ask for leave; you effectively own the company now.",
      "Corporate PR Crisis | News broke of your bathroom gold mine; stock rose 200% instantly.",
      "100% Board Voting Rights | Your word is law; dissenters will be sent to scrub the floors.",
      "Global Water Resource Control | Every drop you flush is merely washing your vast wealth.",
      "The Boss's Termination Notice | Good job, Boss. From today, you can stay home and rest.",
      "Private Satellite Broadcast Rights | Announce to the universe: I just pooped a fortune.",
      "Keys to the Corporate Retreat | That's your private nap room now. No more hiding in stalls.",
      "Solid Gold Punch Clock | Custom-made for you, even though you don't need to clock in anymore.",
      "Finance Department's SOS | You're earning so fast, three of our computers just caught fire.",
      "Infinite Petty Cash Access | Money is just a number; the office is now your personal ATM.",
      "The Boss's Executive Parking Spot | Park your bike there; nobody will dare say a word.",
      "Structural Load Test Report | The gold you've minted is so heavy, the floor is about to collapse.",
      "Global Heated Toilet Seat Treaty | For your dignity, every seat on Earth stays at a constant 38°C.",
      "HR Record Destruction Order | All your late arrivals have vanished into ash. You are perfect.",
      "The Boss's Blood Pressure Meds (Life Contract) | Your existence requires them to keep a lifeline handy.",
      "Life-size Statue in the Lobby | To commemorate your miracle, a monument will stand at the entrance.",
      "Ultimate Guarantee of Freedom | You'll never have to answer to anyone again, except the toilet.",
      "The True Philosopher's Stone | You've reached the pinnacle of alchemy: turning waste into pure gold."
    ]
  },
"landing": {
  "title": "Welcome back, Alchemist.",
  "subtitle": "Don't let HR see the magic."
}
}
